[
    {
        "_id": 1,
        "name": "Volkswagen up!",
        "description": "A Volkswagen UP! az új városi autó koncepciója, amely alapját képezi egy új kisautó-családnak, a Volkswagen Csoport által létrehozott New Small Family-nek (NSF). Ezen autócsalád tagja lesz az új Volkswagen UP!. A jelenlegi tervek szerint a kisautó-család tagjai szalon, szedán, kabrió, kétüléses és mini MPV típusú gépjárművek lesznek. A gyártási folyamatokat Pozsonyban fogják végezni. A kisautócsaládot a 2007-es Frankfurt Motor Show-n az (IAA)-n  leplezték le. Az UP! koncepciót a Volkswagen Csoport vezető tervezője, Walter de'Silva, és a Volkswagen személyautók főtervezője, Klaus Bischoff alkotta meg. Akkumulátoros elektromos változata a Volkswagen e-up!.",
        "image": "https://en.wikipedia.org/wiki/File:2013_Volkswagen_Take_UP!_1.0.jpg",
        "engine": "Otto-motor",
        "horsepower": "60-115 lóerő",
        "releaseDate": "2011"
    },
    {
        "_id": 2,
        "name": "Volkswagen Jetta",
        "description": "Magyarországon az alapmodell az 1,2-es benzines turbómotorral 4,96 millió forintba kerül, 76 ezerrel olcsóbb az azonos motorú Golfnál. Alapmotorral a 0–100 km/h 10,9 másodperc alatt van meg. A végsebessége 190 km/h. Közleményében a Volkswagen hangsúlyozta a modell tágasságát, amelynek alapköve, hogy méretnövekedés hatására 6,7 centivel bővült a lábhely. Az autó elődjeivel ellentétben nem osztozik a karosszériaelemeken a Golffal, hanem teljesen önálló modell. Formáját a januárban bemutatott NCC tanulmány inspirálta. Elődjénél szögletesebb a jármű, külsejét főként a vízszintes élek alkotják, jellegében azonban ugyanazt a hagyományos szedán formát hozza, mint eddig.",
        "image": "https://hu.wikipedia.org/wiki/F%C3%A1jl:VW_Jetta_VI_1.2_TSI_Comfortline_Platinumgrey.JPG",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "105-200 lóerő",
        "releaseDate": "2010"
    },
    {
        "_id": 3,
        "name": "Volkswagen Passat",
        "description": "A nyolcadik generációs modellt 2014 novemberében vezették be az európai kontinensen, 2015 januárjában pedig az Egyesült Királyságban négyajtós limuzin és kombi kivitelben. Számos fejlett, vezetéstámogató rendszerekkel szerelték fel, beleértve a félautomata parkolórendszert, a gyalogos ütközés-elhárító rendszert és a sürgősségi vezető asszisztenst, amely automatikusan átveszi az irányítást a jármű felett, ha a sofőr sérülést szenvedett, vagy orvosi ellátásra szorul. A 2014-ben megválasztott Peugeot 308 modell után a 2015-ös 85-ik genfi kiállításon a VW Passat B8 nyerte el első helyezéssel a hét-kocsis döntőben Az Év Gépkocsija nevet, megelőzve a BMW i3 és a Tesla S modellt.",
        "image": "https://hu.wikipedia.org/wiki/F%C3%A1jl:VW_Passat_B8_Limousine_2.0_TDI_Highline.JPG",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "120-280 lóerő",
        "releaseDate": "2014"
    },
    {
        "_id": 4,
        "name": "Volkswagen Golf",
        "description": "A 2012-es párizsi autószalonon mutatták be a hetedik generációt. A modell a VW-konszern új MQB-platformjára épül. Az autó formája jelentősen különbözött az előző két generációétól. A 3 és 5 ajtós, kombi, valamint az itt már Sportsvannak átkereszrelt MPV modellek mellől végleg kikerült a kabrió a gyártásból.",
        "image": "https://hu.wikipedia.org/wiki/F%C3%A1jl:VW_Golf_1.6_TDI_BlueMotion_Technology_Comfortline_(VII)_%E2%80%93_Frontansicht,_31._Dezember_2012,_D%C3%BCsseldorf.jpg",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "77-360 lóerő",
        "releaseDate": "2012"
    },
    {
        "_id": 5,
        "name": "Volkswagen Tiguan",
        "description": "A második generációs Tiguant 2015 szeptemberében mutatták be a Frankfurti Nemzetközi Autókiállításon a 2016-os modellévre, és a Volkswagen Csoport MQB A2 platformjára építették. Eredetileg a rövid tengelytávú változatot leplezték le, amely 50 kg-mal (110 font) könnyebb, mint a korábbi Tiguan, miközben 60 mm-rel (2,4 hüvelyk) hosszabb, 30 mm-rel (1,2 hüvelyk) szélesebb, és a tengelytávja 77 mm-rel (3,0 hüvelyk) hosszabb. Ennek eredményeként a VW azt állította, hogy javult a belső tér, és a hátsó utasoknak 29 mm-rel (1,1 hüvelyk) több hely jutott a térdüknek. Továbbá, a hátsó üléspad aszimmetrikusan osztott, és akár 180 mm-ig (7,1 hüvelyk) hosszában is állítható.",
        "image": "https://en.wikipedia.org/wiki/File:VW_Tiguan_2.0_TSI_BlueMotion_Technology_4MOTION_Sound_(II)_%E2%80%93_Frontansicht,_24._Dezember_2017,_D%C3%BCsseldorf.jpg",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "113-316 lóerő",
        "releaseDate": "2016"
    },
    {
        "_id": 6,
        "name": "Volkswagen Arteon",
        "description": "A Volkswagen Arteon egy német autógyártó, a Volkswagen által gyártott autó. Nagy családi autóként vagy középkategóriás autóként írják le, és ötajtós liftback vagy kombi karosszéria változatokban elérhető. Az Arteont 2017. március 6-án mutatták be a Genfi Autószalonon, majd a Chicagói Autószalonon is, az észak-amerikai piac számára. Az Arteon közvetlen utódja a CC-nek; azonban a Volkswagen bejelentette, hogy az Arteon magasabb kategóriát céloz meg, mint a CC. Az autó az MQB platformra épül.",
        "image": "https://en.wikipedia.org/wiki/File:2018_Volkswagen_Arteon_2.0.jpg",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "148-276 lóerő",
        "releaseDate": "2017"
    },
    {
        "_id": 7,
        "name": "Volkswagen T-Roc",
        "description": "A Volkswagen T-Roc egy kisméretű crossover SUV, amelyet a német autógyártó, a Volkswagen gyárt. 2017-ben a Frankfurti Autószalonon mutatták be, és 2017 novemberében indították el. Az autó a Volkswagen Csoport MQB A1 platformjára épül, és általában a C-szegmenses Golf SUV megfelelőjeként tartják számon. A T-Roc a Tiguan és a kissé kisebb T-Cross között helyezkedik el, miközben méretben körülbelül megegyezik a Taigóval.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/62/VOLKSWAGEN_T-ROC_China_%2831%29.jpg/1024px-VOLKSWAGEN_T-ROC_China_%2831%29.jpg",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "113-296 lóerő",
        "releaseDate": "2017"
    },
    {
        "_id": 8,
        "name": "Volkswagen ID.3",
        "description": "A Volkswagen ID.3 egy alsó középkategóriás, akkumulátoros elektromos autótípus, mely a Volkswagen első dedikált elektromos autótípusa. A hivatalos bemutatóra 2019. szeptember 9-én került sor a Frankfurti Autószalonon. Az ID.3 az első sorozatgyártású jármű, amely a kifejezetten elektromos autókhoz tervezett MEB-platformon alapul. Az MEB-platformban a hajtóakkumulátor a jármű padlójában foglal helyet. Az ID.3 a Volkswagen ID koncepciójárműre épül. Az ID az „intelligens tervezés” rövidítése. A 3-as szám a kompakt osztályt jelöli. 2021-ben a jármű negyedik lett az Európai Év Autója szavazáson. Az ID.3-at a „Prémium 50 000 euróig” kategóriában választották a győztesnek.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/2020_Volkswagen_ID.3_1st_Front.jpg/1024px-2020_Volkswagen_ID.3_1st_Front.jpg",
        "engine": "Villanymotor",
        "horsepower": "150 kW",
        "releaseDate": "2020"
    },
    {
        "_id": 9,
        "name": "Volkswagen Trasnporter",
        "description": "A Volkswagen T6 a Volkswagen Transporter sorozatának hatodik generációja, amelyet 2015-ben mutattak be. A T6 a márka ikonikus furgonja, amelyet személy- és teherautóként egyaránt forgalmaznak. A Volkswagen Transporter család az egyik legismertebb és legnépszerűbb furgon-sorozat a világon, és a T6 a sorozat egyik legfontosabb modellje, amely több mint öt évtizedes történettel rendelkezik.",
        "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/2017_Volkswagen_Transporter_T28_Highline_TDi_2.0_Front.jpg/1024px-2017_Volkswagen_Transporter_T28_Highline_TDi_2.0_Front.jpg",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "89-201 lóerő",
        "releaseDate": "2016"
    },
    {
        "_id": 10,
        "name": "Volkswagen Polo",
        "description": "A Volkswagen Polo egy szuperminikategóriás (B-szegmens) autó, amelyet a német autógyártó, a Volkswagen gyárt 1975 óta. Európában és más piacokon világszerte értékesítik hatchback, szedán és kombi változatokban a gyártás teljes időszaka alatt. 2018-tól kezdődően hat különböző generációja készült a Polónak, amelyeket általában 'Series' vagy 'Mark' számokkal azonosítanak. Néhány generáció félidőben ráncfelvarráson esett át, és az ilyen frissített változatokat nem hivatalosan a szám után hozzáadott 'F' betűvel nevezik, például Mk2F. Néhány autós szaklap és egyes rajongók a ráncfelvarrásokat külön modellekként kezelik, így az előző generációk esetében a Polo Mk1-től Mk7-ig terjedő elnevezéseket használnak. Minden Polo modell egy két- vagy háromkarakteres Volkswagen Csoportos Típus számmal is azonosítható. Az hivatalos VW Polo történet az I. – IV. szériákat római számokkal[1] vagy arab számokkal jelöli, a ráncfelvarrott változatokat pedig 'Phase II' modelleként emlegetik. Az autó karosszériája az évek során változott, eredetileg hatchback volt, amely az Audi 50-ből származott.",
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Volkswagen_Polo_VI_%282021%29_IMG_5732.jpg/1280px-Volkswagen_Polo_VI_%282021%29_IMG_5732.jpg",
        "engine": "Otto-motor/dízelmotor",
        "horsepower": "65-192 lóerő",
        "releaseDate": "2017"
    }

]